Revit 2027 API
Wave.WaveAmplitude Property
 The property labeled "Amplitude" from the "Wave" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WaveAmplitude { get; }
Public Shared ReadOnly Property WaveAmplitude As String
	Get
public:
static property String^ WaveAmplitude {
	String^ get ();
}
static member WaveAmplitude : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 10000".
See Also
Reference
Wave Class
Autodesk.Revit.DB.Visual Namespace